УТ_для_edt.РасширениеСмарт/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>СПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНедопоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленныхДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9173f63-0738-4171-948a-e90e1e33ba23">
    <name>ВозвратОтХранителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5407710e-c387-4626-8b05-5211234aa07e">
    <name>ВозвратТоваровКомитенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="34640f68-5c62-4ba4-9701-91967a54a881">
    <name>ВозвратТоваровПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ce981ba1-51f7-44d0-99db-29d24af3a802">
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c7a92b86-d4b7-444e-b574-99f2caed6111">
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="883d636d-f604-43b6-9d3c-4aa11be20085">
    <name>ВыплатаЗарплатыРаботнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="987c15be-84c5-4923-a839-5533e7ab4c5c">
    <name>ВыплатаЗарплатыРаздатчиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5378e85b-b5ef-4819-816d-7cff3ed3291f">
    <name>ИнкассацияДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПоСогласованиюСторон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаЛизингодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДБрокером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДСамостоятельно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af539695-7bf1-4480-85fa-d029bcbfda95">
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваровМеждуФилиалами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПереоценкаРасчетовСКлиентами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаСотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоДепозитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоЗаймамВыданным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСДругогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияПерепоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8ed431c8-e520-4853-99da-e30f78c67d3c">
    <name>СдачаДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae5b97e9-6e3e-40da-af52-695ba210a200">
    <name>СписаниеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="733cca42-63ac-4b08-87d9-90abec9c03ec">
    <name>СписаниеКредиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/CommonForms/смартСозданиеДоговораЛизинга/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СегментОборудование = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул","СегментАппаратноеОбеспечение"); 
	Если ЗначениеЗаполнено(СегментОборудование) Тогда		
		Для Каждого Оборудование Из ЭтаФорма.Параметры.ОборудованиеДляДоговора Цикл
			Если ЗначениеЗаполнено(Оборудование) И СегментыСервер.ВходитВСегмент(Оборудование, СегментОборудование, , Ложь) Тогда
				НоваяСтрока 			 = ТаблицаОборудования.Добавить(); 
				НоваяСтрока.НомерСтроки	 = ТаблицаОборудования.Количество();
				НоваяСтрока.Оборудование = Оборудование;
				НоваяСтрока.ШаблонБренда = смартШаблоныПечатныхФормСервер.ПолучитьШаблонБрэндаНоменклатуры(Оборудование);
				НоваяСтрока.НетШаблона 	 = НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонБренда);
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры // ПриСозданииНаСервере

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДоговор(Команда)  
	
	Отказ = Ложь;
	
	Если ТаблицаОборудования.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать договор лизинга: Таблица оборудования не заполнена",,,,Отказ);
	КонецЕсли;  
	
	//++ #5942 смарт: Тимофеева 05.03.26 / Задание на подготовку проекта договора поставки. Договор Лизинга.
	//Для Каждого СтрокаОборудования Из ТаблицаОборудования Цикл
	//	Если СтрокаОборудования.НетШаблона Тогда
	//		ТекстСообщения = СтрШаблон("Не удалось записать договор лизинга: Для оборудования %1 не найден шаблон", СтрокаОборудования.Оборудование);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	//	КонецЕсли;
	//КонецЦикла; 
	//-- #5942 смарт: Тимофеева 05.03.26
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Владелец 	 = ЭтаФорма.ВладелецФормы.Объект;
	ЗаказКлиента = Владелец.Ссылка;
		
	НовыйДоговор = СоздатьДоговорНаСервере(ЗаказКлиента);
	
	Если НЕ НовыйДоговор = Неопределено Тогда
		Владелец.Договор = НовыйДоговор;
		
		МассивСообщений = Новый Массив;
		ОтправитьУведомление(МассивСообщений, ЗаказКлиента, НовыйДоговор);
		
		СтруктураДляВладельца = Новый Структура;
		СтруктураДляВладельца.Вставить("НовыйДоговор",		НовыйДоговор); 
		СтруктураДляВладельца.Вставить("МассивСообщений",	МассивСообщений);
		
		Оповестить("СозданДоговорЛизинга", СтруктураДляВладельца, ЭтаФорма);
		ЭтаФорма.Закрыть(); 	
	КонецЕсли;	            
	
КонецПроцедуры // СоздатьДоговор

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьДоговорНаСервере(ЗаказКлиента)
    Результат 	 = Неопределено;
	Запрос 		 = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Ссылка КАК смартЗаказКлиента,
	|	""ЛИЗИНГ"" КАК Номер,
	|	""Договор лизинга"" КАК Наименование,
	|   ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем) КАК ТипДоговора,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(СоглашенияСКлиентами.ВалютаВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА СоглашенияСКлиентами.ВалютаВзаиморасчетов
	|		ИНАЧЕ ЕСТЬNULL(СоглашенияСКлиентами.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(СоглашенияСКлиентами.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка)) КАК ГруппаФинансовогоУчета,
	|	ЗаказКлиента.Контрагент КАК Контрагент,
	|	ЗаказКлиента.Организация КАК Организация,
	|	ЗаказКлиента.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказКлиента.Партнер КАК Партнер,
	|	ЗаказКлиента.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует) КАК Статус,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС) КАК НалогообложениеНДС,
	//++ #5468 смарт: Тимофеева 26.01.26 / Задание на подготовку проекта договора поставки. Скорректировать установку ставки НДС.
	//|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20) КАК СтавкаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22) КАК СтавкаНДС,
	//-- #5468 смарт: Тимофеева 26.01.26
	|	ЗНАЧЕНИЕ(Перечисление.смартВидыДоговоров.Оборудование) КАК смартВидДоговора,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента) КАК СтатьяДвиженияДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокРасчетов.ПоЗаказамНакладным) КАК ПорядокРасчетов,
	|	ЗаказКлиента.Менеджер КАК Менеджер
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	|		ПО ЗаказКлиента.Соглашение = СоглашенияСКлиентами.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЗаказКлиента);
	РезультатЗапроса = Запрос.Выполнить();
	
	ДоговорОбъект = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();	
	//++ #5942 смарт: Тимофеева 05.03.26 / Задание на подготовку проекта договора поставки. Договор Лизинга.
	//ДоговорОбъект.смартШаблонБренда = ТаблицаОборудования[0].ШаблонБренда;
	//-- #5942 смарт: Тимофеева 05.03.26
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПараметрыСозданияСтрокой = "ВалютаВзаиморасчетов, ГруппаФинансовогоУчета, ХозяйственнаяОперация, Организация, Контрагент, Партнер, БанковскийСчет, НалогообложениеНДС";
		ПараметрыСоздания		 = Новый Структура(ПараметрыСозданияСтрокой);
		ЗаполнитьЗначенияСвойств(ПараметрыСоздания, ВыборкаДетальныеЗаписи);
		ДоговорОбъект.Заполнить(ПараметрыСоздания);
		ЗаполнитьЗначенияСвойств(ДоговорОбъект, ВыборкаДетальныеЗаписи,, ПараметрыСозданияСтрокой);
		ДоговорОбъект.смартТекстЗаданияНаПодготовку = СформироватьТекстЗаданияНаПодготовку(ВыборкаДетальныеЗаписи, ТаблицаОборудования.Выгрузить());
	КонецЕсли;	
		
	Попытка
		ДоговорОбъект.Записать();
		Результат = ДоговорОбъект.Ссылка;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось записать договор лизинга по %1", ЗаказКлиента));
	КонецПопытки;
	
	Возврат Результат;
КонецФункции // СоздатьДоговорНаСервере 

&НаСервере
Процедура ОтправитьУведомление(МассивСообщений, ЗаказКлиента, ДоговорСсылка)	
    Справочники.ДоговорыКонтрагентов.ОтправитьПисьма(МассивСообщений, ДоговорСсылка.смартТекстЗаданияНаПодготовку, ЗаказКлиента, ДоговорСсылка.Номер);
КонецПроцедуры // ОтправитьУведомление

&НаСервере
Функция СформироватьТекстЗаданияНаПодготовку(ПараметрыДоговора, ТаблицаОборудованияШаблонов)	
	СтруктураОборудования = ПолучитьТекстНоменклатурыИШаблонов(ТаблицаОборудованияШаблонов);
    //++ #5942 смарт: Тимофеева 05.03.26 / Задание на подготовку проекта договора поставки. Договор Лизинга.
	//Возврат СтрШаблон("Создание договора  лизинга по Заказу клиента №%1 от %2
	//				|
	//				|Организация: %3
	//				|Контрагент: %4
	//				|Номенклатура: %5
	//				|Основной шаблон бренда: %6
	//				|Менеджер: %7
	//				|Ссылка на заказ клиента: %8",
	//				ПараметрыДоговора.смартЗаказКлиента.Номер,
	//				Формат(ПараметрыДоговора.смартЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"),
	//				ПараметрыДоговора.Организация,
	//				ПараметрыДоговора.Контрагент,
	//				СтруктураОборудования.Номенклатура,
	//				СтруктураОборудования.Шаблон,
	//				ПараметрыДоговора.Менеджер,
	//				ПолучитьНавигационнуюСсылку(ПараметрыДоговора.смартЗаказКлиента));
	Возврат СтрШаблон("Создание договора  лизинга по Заказу клиента №%1 от %2
					|
					|Организация: %3
					|Контрагент: %4
					|Номенклатура: %5
					|Менеджер: %6
					|Ссылка на заказ клиента: %7",
					ПараметрыДоговора.смартЗаказКлиента.Номер,
					Формат(ПараметрыДоговора.смартЗаказКлиента.Дата, "ДФ=dd.MM.yyyy"),
					ПараметрыДоговора.Организация,
					ПараметрыДоговора.Контрагент,
					СтруктураОборудования.Номенклатура,
					ПараметрыДоговора.Менеджер,
					ПолучитьНавигационнуюСсылку(ПараметрыДоговора.смартЗаказКлиента)); 
	//-- #5942 смарт: Тимофеева 05.03.26
КонецФункции // СформироватьТекстЗаданияНаПодготовку 

&НаСервере
Функция ПолучитьТекстНоменклатурыИШаблонов(ТаблицаОборудованияШаблонов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаОборудования.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОборудования.Оборудование КАК Номенклатура,
	|	ТаблицаОборудования.ШаблонБренда КАК Шаблон
	|ПОМЕСТИТЬ ВТ_Оборудование
	|ИЗ
	|	&ТаблицаОборудования КАК ТаблицаОборудования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Оборудование.Шаблон КАК Шаблон,
	|	МИНИМУМ(ВТ_Оборудование.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ВТ_Оборудование КАК ВТ_Оборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Оборудование.Шаблон
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Оборудование.Номенклатура.НаименованиеПолное КАК Номенклатура,
	|	МИНИМУМ(ВТ_Оборудование.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ВТ_Оборудование КАК ВТ_Оборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Оборудование.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("ТаблицаОборудования", ТаблицаОборудованияШаблонов);
	РезультатЗапроса 	= Запрос.ВыполнитьПакет();
	МассивНоменклатуры	= РезультатЗапроса[2].Выгрузить().ВыгрузитьКолонку("Номенклатура");
	МассивШаблонов		= РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Шаблон"); 	
	Возврат Новый Структура("Номенклатура, Шаблон", СтрСоединить(МассивНоменклатуры, "; "), СтрСоединить(МассивШаблонов, "; "));	
КонецФункции // ПолучитьТекстНоменклатурыИШаблонов

#КонецОбласти

//++ #4044 смарт: Тимофеева 22.08.2025 / Задание на подготовку проекта договора поставки. Создание лизингового договора (смарт). Доработка.
//&НаКлиенте
//Процедура СоздатьДоговор(Команда)
//	Владелец=ЭтаФорма.ВладелецФормы.Объект; 
//	Успех=ПроверитьЗаполнение(); 
//	Если Не Успех Тогда
//		Возврат;
//	КонецЕсли;
//	Если СписокСуфиксов.Количество()=0 Тогда
//		Сообщить("Не заполнены шаблоны бренда!");
//		Возврат;
//	Иначе                                                    
//		Успех=Истина;
//		Для Каждого Стр Из СписокСуфиксов Цикл
//			Если НЕ ЗначениеЗаполнено(ЭтаФорма["Оборудование"+Стр.Значение]) Тогда	
//				Сообщить("Оборудование "+Стр.Значение+" не заполнено");
//				Успех=Ложь;
//			КонецЕсли;	
//			Если НЕ ЗначениеЗаполнено(ЭтаФорма["ШаблонБренда"+Стр.Значение]) Тогда	
//				Сообщить("Шаблон бренда "+Стр.Значение+" не заполнен");	
//				Успех=Ложь;
//			КонецЕсли;	
//		КонецЦикла;	
//		Если Не Успех Тогда
//			Возврат;
//		КонецЕсли;
//	КонецЕсли;	
//	МассивСообщений = Новый Массив;
//	НовыйДоговор=СоздатьДоговорНаСервере(Владелец,МассивСообщений);
//	Если НовыйДоговор=неопределено Тогда
//		Возврат;
//	КонецЕсли;	
//	СтруктураДляВладельца = Новый Структура;
//	СтруктураДляВладельца.Вставить("НовыйДоговор",НовыйДоговор); 
//	СтруктураДляВладельца.Вставить("МассивСообщений",МассивСообщений);
//	
//	Оповестить("СозданДоговорЛизинга",СтруктураДляВладельца,ЭтаФорма);
//	ЭтаФорма.Закрыть();
//КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	//++ #1497 смарт: Фролов 12.10.2023 //Рефакторинг получения списка шаблонов бренда
//	СписВыб=смартСервер.ПолучитьСписокШаблоновБренда(ЭтаФорма.Параметры.Организация);
//	//-- #1497 смарт: Фролов 12.10.2023

//	КоличествоОборудования=0;
//	Для Каждого Стр Из ЭтаФорма.Параметры.ОборудованиеДляДоговора Цикл
//		КоличествоОборудования=КоличествоОборудования+1;
//	
//		ДобавитьОборудованиеИШаблоны(Стр,"N"+КоличествоОборудования);
//	   	СписокСуфиксов.Добавить("N"+КоличествоОборудования);
//	КонецЦикла; 
//	КомандаУдалитьОборудование = ЭтаФорма.Команды.Добавить("ДобавитьОборудование");
//	КомандаУдалитьОборудование.Картинка = БиблиотекаКартинок.ДобавитьЭлементСписка;
//	КомандаУдалитьОборудование.Действие = "ДобавитьНовоеОборудование";
//	НовыйЭлемент = Элементы.Добавить("КнопкаДобавитьОборудование", Тип("КнопкаФормы"),Элементы.ГруппаОборудованиеИШаблоны);
//	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
//	НовыйЭлемент.Заголовок = "Добавить";
//	НовыйЭлемент.ИмяКоманды = "ДобавитьОборудование";
//	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
//	НовыйЭлемент.Видимость = Истина;
//	НовыйЭлемент.Доступность = Истина;
//КонецПроцедуры   

//&НаСервере
//Функция СоздатьДоговорНаСервере(Владелец,МассивСообщений)
//	НовыйДоговор=Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
//	ДанныеДляЗаполнения=Новый Структура();
//	ДанныеДляЗаполнения.Вставить("ВалютаВзаиморасчетов",?(ЗначениеЗаполнено(Владелец.Соглашение.ВалютаВзаиморасчетов),Владелец.Соглашение.ВалютаВзаиморасчетов,Владелец.Соглашение.Валюта));
//	ДанныеДляЗаполнения.Вставить("ГруппаФинансовогоУчета",Владелец.Соглашение.ГруппаФинансовогоУчета);
//	ДанныеДляЗаполнения.Вставить("Контрагент",Владелец.Контрагент);
//	ДанныеДляЗаполнения.Вставить("Организация",Владелец.Организация);
//	ДанныеДляЗаполнения.Вставить("ПометкаУдаления",Ложь);
//	ДанныеДляЗаполнения.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.РеализацияКлиенту); 
//	ДанныеДляЗаполнения.Вставить("БанковскийСчет",Владелец.БанковскийСчет); 
//	ДанныеДляЗаполнения.Вставить("Партнер",Владелец.Партнер);
//	ДанныеДляЗаполнения.Вставить("НалогообложениеНДС",перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
//	НовыйДоговор.Заполнить(ДанныеДляЗаполнения);
//	НовыйДоговор.СтавкаНДС=Перечисления.СтавкиНДС.НДС20;
//	НовыйДоговор.смартВидДоговора = Перечисления.смартВидыДоговоров.Оборудование;
//	НовыйДоговор.Подразделение=Владелец.Подразделение; 
// 	НовыйДоговор.Статус=Перечисления.СтатусыДоговоровКонтрагентов.Действует;
//	Первый=Истина;  
//	СпсШаблонов=Новый СписокЗначений;
//	Для Каждого Стр Из СписокСуфиксов Цикл
//		СтрокасмартШаблоныБренда=НовыйДоговор.смартШаблоныБренда.Добавить();
//		СтрокасмартШаблоныБренда.ШаблонБренда=ЭтаФорма["ШаблонБренда"+Стр.Значение];
//		СтрокасмартШаблоныБренда.Оборудование=ЭтаФорма["Оборудование"+Стр.Значение];
//		Если Первый Тогда
//			НовыйДоговор.смартШаблонБренда=ЭтаФорма["ШаблонБренда"+Стр.Значение];
//			Первый=Ложь;
//		КонецЕсли;
//		Если СпсШаблонов.НайтиПоЗначению(ЭтаФорма["ШаблонБренда"+Стр.Значение])=Неопределено Тогда
//			СпсШаблонов.Добавить(ЭтаФорма["ШаблонБренда"+Стр.Значение]);	
//		КонецЕсли;
//	КонецЦикла;	
//	НовыйДоговор.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.ПоступлениеОплатыОтКлиента; 
//	НовыйДоговор.смартЗаказКлиента=Владелец.Ссылка;
//	НовыйДоговор.Номер="ЛИЗИНГ";
//	НовыйДоговор.Наименование="Договор лизинга";
//	НовыйДоговор.ПорядокРасчетов=Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
//	НовыйДоговор.смартТекстЗаданияНаПодготовку=СформироватьТекстЗаданияНаПодготовку(Владелец,СпсШаблонов);
//	НовыйДоговор.Записать();
//	Владелец.Договор=НовыйДоговор.Ссылка; 
//	Успех = Справочники.ДоговорыКонтрагентов.ОтправитьПисьма(МассивСообщений,НовыйДоговор.смартТекстЗаданияНаПодготовку,Владелец.Ссылка,НовыйДоговор.Номер) ;
//	Возврат НовыйДоговор.Ссылка;
//КонецФункции 

//&НаСервере
//Функция СформироватьТекстЗаданияНаПодготовку(Владелец,СпсШаблонов)
//	ТекстЗаданияНаПодготовку="Создание договора  лизинга по Заказу клиента №"+Владелец.Номер+" от "+Формат(Владелец.Дата,"ДФ=dd.MM.yyyy")+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Организация: "+Владелец.Организация+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Контрагент: "+Владелец.Контрагент+Символы.ПС;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Основной шаблон бренда: "+СпсШаблонов[0].Значение+Символы.ПС;
//	Если СпсШаблонов.Количество()>1 Тогда
//		ТекстБренды="";
//		Для Каждого СтрСпсШаблонов Из СпсШаблонов Цикл
//			Если СпсШаблонов[0].Значение <> СтрСпсШаблонов.Значение Тогда
//				ТекстБренды=ТекстБренды+СтрСпсШаблонов.Значение+";";
//			КонецЕсли;
//		КонецЦикла; 
//		ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Другие шаблоны бренда: "+ТекстБренды+Символы.ПС;
//	КонецЕсли;	
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Менеджер: "+Владелец.Менеджер;
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+Символы.ПС; 
//	
//	ТекстЗаданияНаПодготовку=ТекстЗаданияНаПодготовку+"Ссылка на заказ клиента: "+ПолучитьНавигационнуюСсылку(Владелец.Ссылка);;
//	Возврат ТекстЗаданияНаПодготовку;	
//КонецФункции 

//&НаСервере
//Процедура ДобавитьОборудованиеИШаблоны(Стр=Неопределено,Суфикс,ЭлементПривязки=Неопределено)
//	ДобавляемыеРеквизиты = Новый Массив;
//	
//	ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
//	РеквизитФормы = Новый РеквизитФормы("Оборудование"+Суфикс,ТипРеквизита,"","Оборудование "+Суфикс);
//	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);     
//	КС = Новый КвалификаторыСтроки(100);
//	Массив = Новый Массив;
//	Массив.Добавить(Тип("Строка"));
//	ТипРеквизита = Новый ОписаниеТипов(Массив, , КС);
//	РеквизитФормы = Новый РеквизитФормы("ШаблонБренда"+Суфикс,ТипРеквизита,"","Шаблон бренда "+Суфикс);
//	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);                                                                                     
//	
//	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
//	ЭтаФорма["Оборудование"+Суфикс] = Стр;
//	
//	НовыйЭлемент = Этаформа.Элементы.Вставить("ГруппаОборудование"+Суфикс, Тип("ГруппаФормы"), Элементы.ГруппаОборудованиеИШаблоны,?(ЭлементПривязки=Неопределено,Неопределено,Элементы["КнопкаДобавитьОборудование"]));
//	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
//	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
//	НовыйЭлемент.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
//	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
//	
//	ПолеВвода = Элементы.Добавить("ФормаОборудование"+Суфикс, Тип("ПолеФормы"), Элементы["ГруппаОборудование"+Суфикс]);
//	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВвода.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
//	ПолеВвода.ПутьКДанным = "Оборудование"+Суфикс;
//	
//	ПолеВвода = Элементы.Добавить("ФормаШаблонБренда"+Суфикс, Тип("ПолеФормы"), Элементы["ГруппаОборудование"+Суфикс]);
//	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
//	ПолеВвода.Ширина=15;
//	ПолеВвода.ПоложениеЗаголовка=ПоложениеЗаголовкаЭлементаФормы.Верх;
//	ПолеВвода.ПутьКДанным = "ШаблонБренда"+Суфикс;
//	Элементы["ФормаШаблонБренда"+Суфикс].КнопкаВыпадающегоСписка = Истина;
//	Для Каждого ЭлементСписка Из СписВыб Цикл
//		Элементы["ФормаШаблонБренда"+Суфикс].СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
//	КонецЦикла; 
//	
//	КомандаУдалитьОборудование = ЭтаФорма.Команды.Добавить("УдалитьОборудование"+Суфикс);
//	КомандаУдалитьОборудование.Картинка = БиблиотекаКартинок.УдалитьЭлементСписка;
//	КомандаУдалитьОборудование.Действие = "УдалитьТекущееОборудование";
//	НовыйЭлемент = Элементы.Добавить("КнопкаУдалитьОборудование"+Суфикс, Тип("КнопкаФормы"),Элементы["ГруппаОборудование"+Суфикс]);
//	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
//	НовыйЭлемент.Заголовок = "Удалить оборудование";
//	НовыйЭлемент.ИмяКоманды = "УдалитьОборудование"+Суфикс;
//	НовыйЭлемент.Отображение = ОтображениеКнопки.Картинка;
//	НовыйЭлемент.Видимость = Истина;
//	НовыйЭлемент.Доступность = Истина;
//КонецПроцедуры                                       
//												   

//&НаКлиенте
//Процедура УдалитьТекущееОборудование()
//	Суфикс=СтрЗаменить(ЭтаФорма.ТекущийЭлемент.ИмяКоманды,"УдалитьОборудование",""); 
//	УдалитьТекущееОборудованиеНаСервере(Суфикс);
//КонецПроцедуры	

//&НаСервере
//Процедура УдалитьТекущееОборудованиеНаСервере(Суфикс)
//	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты(); 
//	МассивУдаляемых = Новый Массив;                                          
//	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
//	    ИмяРеквизита = РеквизитФормы.Имя; 
//		Если СтрНайти(ИмяРеквизита, "Оборудование"+Суфикс) ИЛИ СтрНайти(ИмяРеквизита, "ШаблонБренда"+Суфикс)
//			ИЛИ СтрНайти(ИмяРеквизита, "КнопкаУдалитьОборудование"+Суфикс) ИЛИ СтрНайти(ИмяРеквизита, "ГруппаОборудование"+Суфикс)  Тогда 
//	        МассивУдаляемых.Добавить(ИмяРеквизита);
//	    КонецЕсли;
//	КонецЦикла; 
//	Элементы["КнопкаУдалитьОборудование"+Суфикс].Видимость=Ложь;
//	ИзменитьРеквизиты( , МассивУдаляемых); 
//	НайденныйЭлемент = СписокСуфиксов.НайтиПоЗначению(Суфикс);
//	Если НайденныйЭлемент <> Неопределено Тогда
//    	СписокСуфиксов.Удалить(НайденныйЭлемент); 
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ДобавитьНовоеОборудование() 
//	КоличествоОборудования=КоличествоОборудования+1;
//	ДобавитьОборудованиеИШаблоны(,"N"+КоличествоОборудования,Истина);
//	СписокСуфиксов.Добавить("N"+КоличествоОборудования);
//КонецПроцедуры

//-- #4044 смарт: Тимофеева 22.08.2025
